
type_of_file = input("Укажи тип файлов для смешивания: ")
dir_to_randomize = input("Укажи папку с файлами для смешивания: ")


# Просканировать dir_to_randomize на предмет type_of_file
# На выходе надо получить список файлов type_of_file - №1
def find_all_mp3():
    pass


# Сделать перемешивание списка
# получить список - №2
def randomize_list():
    pass


# Считаем длину полученного списка и создаем список рэндом-номеров такой длины
# Именно элементы этого списка мы подставим в наименование файла из первого списка
def make_random_helplist():
    pass

# Смена аттрибутов файлов в папке
# Необходимо сменить дату создания, правки и последнего обращения к файлу
def make_one_date():
    pass

# Переименование элементов из первого списка
# Добавляем им числа из второго списка (добавим еще префикс "-")
# Поскольку первый список уже перемешан, то добавляем по порядку
def rename_files():
    pass


def main():
    pass


if __name__ == '__main__':
    main()






